tefilus/MBD_PMSM/exampleFOCQep/mcb_pmsm_foc_qep_f28069LaunchPad_ert_rtw/mcb_pmsm_foc_qep_f28069LaunchPad.h
/*
 * File: mcb_pmsm_foc_qep_f28069LaunchPad.h
 *
 * Code generated for Simulink model 'mcb_pmsm_foc_qep_f28069LaunchPad'.
 *
 * Model version                  : 8.11
 * Simulink Coder version         : 23.2 (R2023b) 01-Aug-2023
 * C/C++ source code generated on : Fri May 16 16:46:44 2025
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: Texas Instruments->C2000
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#ifndef RTW_HEADER_mcb_pmsm_foc_qep_f28069LaunchPad_h_
#define RTW_HEADER_mcb_pmsm_foc_qep_f28069LaunchPad_h_
#ifndef mcb_pmsm_foc_qep_f28069LaunchPad_COMMON_INCLUDES_
#define mcb_pmsm_foc_qep_f28069LaunchPad_COMMON_INCLUDES_
#include "rtwtypes.h"
#include "c2000BoardSupport.h"
#include "F2806x_Device.h"
#include "F2806x_Gpio.h"
#include "DSP28xx_SciUtil.h"
#include "F2806x_Examples.h"
#include "IQmathLib.h"
#include "MW_SPI.h"
#endif                   /* mcb_pmsm_foc_qep_f28069LaunchPad_COMMON_INCLUDES_ */

#include "MW_c2000ISR.h"
#include "mcb_pmsm_foc_qep_f28069LaunchPad_types.h"
#include <string.h>
#include "rt_nonfinite.h"
#include <stddef.h>
#include "MW_target_hardware_resources.h"

/* Macros for accessing real-time model data structure */
#ifndef rtmGetErrorStatus
#define rtmGetErrorStatus(rtm)         ((rtm)->errorStatus)
#endif

#ifndef rtmSetErrorStatus
#define rtmSetErrorStatus(rtm, val)    ((rtm)->errorStatus = (val))
#endif

#ifndef rtmStepTask
#define rtmStepTask(rtm, idx)          ((rtm)->Timing.TaskCounters.TID[(idx)] == 0)
#endif

#ifndef rtmTaskCounter
#define rtmTaskCounter(rtm, idx)       ((rtm)->Timing.TaskCounters.TID[(idx)])
#endif

#define mcb_pmsm_foc_qep_f28069LaunchPad_M (mcb_pmsm_foc_qep_f28069Launc_M)

extern void init_SCI(void);
extern void init_SCI_GPIO(void);
extern void config_ePWM_GPIO (void);
extern void config_ePWM_TBSync (void);
extern void config_ePWM_XBAR(void);

/* Block signals for system '<S19>/Two inputs CRL' */
typedef struct {
  real32_T qcos;                       /* '<S144>/qcos' */
  real32_T dsin;                       /* '<S144>/dsin' */
  real32_T sum_beta;                   /* '<S144>/sum_beta' */
  real32_T dcos;                       /* '<S144>/dcos' */
  real32_T qsin;                       /* '<S144>/qsin' */
  real32_T sum_alpha;                  /* '<S144>/sum_alpha' */
  real32_T Switch[2];                  /* '<S145>/Switch' */
  real32_T algDD_o1;
  real32_T algDD_o2;
} rtB_TwoinputsCRL_mcb_pmsm_foc_q;

/* Block signals for system '<S149>/If Action Subsystem' */
typedef struct {
  real32_T Convert_back;               /* '<S151>/Convert_back' */
  int16_T Convert_uint16;              /* '<S151>/Convert_uint16' */
} rtB_IfActionSubsystem_mcb_pmsm_;

/* Block signals for system '<S149>/If Action Subsystem1' */
typedef struct {
  real32_T Convert_back;               /* '<S152>/Convert_back' */
  int16_T Convert_uint16;              /* '<S152>/Convert_uint16' */
} rtB_IfActionSubsystem1_mcb_pmsm;

/* Block signals for system '<S227>/SPI Master Transfer' */
typedef struct {
  uint16_T SPIMasterTransfer;          /* '<S227>/SPI Master Transfer' */
} rtB_SPIMasterTransfer_mcb_pmsm_;

/* Block states (default storage) for system '<S227>/SPI Master Transfer' */
typedef struct {
  codertarget_tic2000_blocks_SPIM obj; /* '<S227>/SPI Master Transfer' */
  boolean_T objisempty;                /* '<S227>/SPI Master Transfer' */
} rtDW_SPIMasterTransfer_mcb_pmsm;

/* Block signals for system '<Root>/Speed Control' */
typedef struct {
  real32_T Id_Ref;                     /* '<S7>/Id_Ref' */
  real32_T Switch;                     /* '<S242>/Switch' */
  real32_T Product;                    /* '<S297>/Product' */
  real32_T UnitDelay;                  /* '<S297>/Unit Delay' */
  real32_T Product1;                   /* '<S297>/Product1' */
  real32_T Add1;                       /* '<S297>/Add1' */
  real32_T Sum;                        /* '<S241>/Sum' */
  real32_T PProdOut;                   /* '<S283>/PProd Out' */
  real32_T Ki2;                        /* '<S241>/Ki2' */
  real32_T Integrator;                 /* '<S278>/Integrator' */
  real32_T Sum_n;                      /* '<S287>/Sum' */
  real32_T DeadZone;                   /* '<S271>/DeadZone' */
  real32_T IProdOut;                   /* '<S275>/IProd Out' */
  real32_T Switch_d;                   /* '<S269>/Switch' */
  real32_T Saturation;                 /* '<S285>/Saturation' */
  int16_T Switch1;                     /* '<S269>/Switch1' */
  int16_T Switch2;                     /* '<S269>/Switch2' */
  boolean_T DataStoreRead;             /* '<S241>/Data Store Read' */
  boolean_T DataStoreRead_o;           /* '<S242>/Data Store Read' */
  boolean_T DataStoreRead1;            /* '<S242>/Data Store Read1' */
  boolean_T AND;                       /* '<S242>/AND' */
  boolean_T LogicalOperator;           /* '<S241>/Logical Operator' */
  boolean_T RelationalOperator;        /* '<S269>/Relational Operator' */
  boolean_T fixforDTpropagationissue;/* '<S269>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                    /* '<S269>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S269>/Equal1' */
  boolean_T AND3;                      /* '<S269>/AND3' */
} rtB_SpeedControl_mcb_pmsm_foc_q;

/* Block states (default storage) for system '<Root>/Speed Control' */
typedef struct {
  real32_T UnitDelay_DSTATE;           /* '<S297>/Unit Delay' */
  real32_T Integrator_DSTATE;          /* '<S278>/Integrator' */
  int16_T Integrator_PrevResetState;   /* '<S278>/Integrator' */
} rtDW_SpeedControl_mcb_pmsm_foc_;

/* Block signals (default storage) */
typedef struct {
  uint32_T PositionToCount;            /* '<S189>/PositionToCount' */
  uint32_T Delay;                      /* '<S189>/Delay' */
  uint32_T Sum[4];                     /* '<S165>/Sum' */
  uint32_T Sum_k[4];                   /* '<S21>/Sum' */
  real32_T RT1;                        /* '<Root>/RT1' */
  real32_T RT6;                        /* '<Root>/RT6' */
  real32_T DataTypeConversion1[2];     /* '<S238>/Data Type Conversion1' */
  real32_T DataTypeConversion1_d;      /* '<S6>/Data Type Conversion1' */
  real32_T DTC;                        /* '<S207>/DTC' */
  real32_T Product;                    /* '<S188>/Product' */
  real32_T DTC_i;                      /* '<S212>/DTC' */
  real32_T SpeedGain;                  /* '<S189>/SpeedGain' */
  real32_T Product_a;                  /* '<S192>/Product' */
  real32_T UnitDelay;                  /* '<S192>/Unit Delay' */
  real32_T Product1;                   /* '<S192>/Product1' */
  real32_T Add1;                       /* '<S192>/Add1' */
  real32_T Switch;                     /* '<S196>/Switch' */
  real32_T Merge;                      /* '<S197>/Merge' */
  real32_T Numberofpolepairs;          /* '<S202>/Number of pole pairs' */
  real32_T Floor;                      /* '<S198>/Floor' */
  real32_T Add;                        /* '<S198>/Add' */
  real32_T DataTypeConversion1_k[2];   /* '<S184>/Data Type Conversion1' */
  real32_T DataTypeConversion;         /* '<S12>/Data Type Conversion' */
  real32_T Switch_d[3];                /* '<S8>/Switch' */
  real32_T Gain[3];                    /* '<S12>/Gain' */
  real32_T PWM_Duty_Cycles[3];         /* '<S12>/Sum' */
  real32_T rpm2freq;                   /* '<S16>/rpm2freq' */
  real32_T Eps;                        /* '<S162>/Ramp Generator' */
  real32_T Product_b;                  /* '<S16>/Product' */
  real32_T Frequency;                  /* '<S16>/Abs' */
  real32_T Vbyf;                       /* '<S16>/V-by-f' */
  real32_T Correction_Factor_sinePWM;  /* '<S16>/Correction_Factor_sinePWM' */
  real32_T Amplitude;                  /* '<S16>/Saturation' */
  real32_T UnaryMinus;                 /* '<S160>/Unary Minus' */
  real32_T position_increment;         /* '<S16>/position_increment' */
  real32_T scaleIn;                    /* '<S161>/scaleIn' */
  real32_T UnitDelay_a;                /* '<S161>/Unit Delay' */
  real32_T scaleOut;                   /* '<S161>/scaleOut' */
  real32_T DataStoreRead;              /* '<S16>/Data Store Read' */
  real32_T Eps_c;                      /* '<S16>/Direction' */
  real32_T convert_pu;                 /* '<S170>/convert_pu' */
  real32_T Merge_m;                    /* '<S170>/Merge' */
  real32_T indexing;                   /* '<S165>/indexing' */
  real32_T Lookup[4];                  /* '<S165>/Lookup' */
  real32_T Sum3;                       /* '<S169>/Sum3' */
  real32_T DataTypeConversion1_e;      /* '<S165>/Data Type Conversion1' */
  real32_T Sum2;                       /* '<S165>/Sum2' */
  real32_T Product_m;                  /* '<S169>/Product' */
  real32_T Sum4;                       /* '<S169>/Sum4' */
  real32_T Sum5;                       /* '<S169>/Sum5' */
  real32_T Product1_i;                 /* '<S169>/Product1' */
  real32_T Sum6;                       /* '<S169>/Sum6' */
  real32_T Ka;                         /* '<S166>/Ka' */
  real32_T one_by_two;                 /* '<S166>/one_by_two' */
  real32_T sqrt3_by_two;               /* '<S166>/sqrt3_by_two' */
  real32_T add_b;                      /* '<S166>/add_b' */
  real32_T Kb;                         /* '<S166>/Kb' */
  real32_T add_c;                      /* '<S166>/add_c' */
  real32_T Kc;                         /* '<S166>/Kc' */
  real32_T Divide;                     /* '<S162>/Divide' */
  real32_T Sample_Time;                /* '<S162>/Sample_Time' */
  real32_T Sum_c;                      /* '<S16>/Sum' */
  real32_T Add_l;                      /* '<S174>/Add' */
  real32_T DataTypeConversion1_n;      /* '<S174>/Data Type Conversion1' */
  real32_T Add1_e;                     /* '<S174>/Add1' */
  real32_T Input;                      /* '<S175>/Input' */
  real32_T Idq_ref_PU[2];              /* '<S15>/Idq_ref_PU' */
  real32_T Merge_p;                    /* '<S149>/Merge' */
  real32_T indexing_b;                 /* '<S21>/indexing' */
  real32_T Lookup_o[4];                /* '<S21>/Lookup' */
  real32_T Sum3_j;                     /* '<S148>/Sum3' */
  real32_T DataTypeConversion1_kd;     /* '<S21>/Data Type Conversion1' */
  real32_T Sum2_e;                     /* '<S21>/Sum2' */
  real32_T Product_g;                  /* '<S148>/Product' */
  real32_T Sum4_c;                     /* '<S148>/Sum4' */
  real32_T Sum5_d;                     /* '<S148>/Sum5' */
  real32_T Product1_d;                 /* '<S148>/Product1' */
  real32_T Sum6_m;                     /* '<S148>/Sum6' */
  real32_T Sum_f;                      /* '<S27>/Sum' */
  real32_T PProdOut;                   /* '<S132>/PProd Out' */
  real32_T Kp1;                        /* '<S27>/Kp1' */
  real32_T Integrator;                 /* '<S127>/Integrator' */
  real32_T Sum_b;                      /* '<S136>/Sum' */
  real32_T Saturation;                 /* '<S134>/Saturation' */
  real32_T Sum_p;                      /* '<S26>/Sum' */
  real32_T PProdOut_k;                 /* '<S81>/PProd Out' */
  real32_T Ki1;                        /* '<S26>/Ki1' */
  real32_T Integrator_g;               /* '<S76>/Integrator' */
  real32_T Sum_o;                      /* '<S85>/Sum' */
  real32_T Saturation_g;               /* '<S83>/Saturation' */
  real32_T Switch_p;                   /* '<S30>/Switch' */
  real32_T Product_p;                  /* '<S30>/Product' */
  real32_T Product_ph;                 /* '<S31>/Product' */
  real32_T Product1_l;                 /* '<S31>/Product1' */
  real32_T Sum1;                       /* '<S31>/Sum1' */
  real32_T Merge_d[2];                 /* '<S25>/Merge' */
  real32_T DeadZone;                   /* '<S69>/DeadZone' */
  real32_T IProdOut;                   /* '<S73>/IProd Out' */
  real32_T Switch_j;                   /* '<S67>/Switch' */
  real32_T DeadZone_d;                 /* '<S120>/DeadZone' */
  real32_T IProdOut_p;                 /* '<S124>/IProd Out' */
  real32_T Switch_m;                   /* '<S118>/Switch' */
  real32_T one_by_two_m;               /* '<S159>/one_by_two' */
  real32_T sqrt3_by_two_o;             /* '<S159>/sqrt3_by_two' */
  real32_T add_b_h;                    /* '<S159>/add_b' */
  real32_T add_c_f;                    /* '<S159>/add_c' */
  real32_T Max;                        /* '<S156>/Max' */
  real32_T Min;                        /* '<S156>/Min' */
  real32_T Add_h;                      /* '<S156>/Add' */
  real32_T one_by_two_b;               /* '<S156>/one_by_two' */
  real32_T Add1_p;                     /* '<S155>/Add1' */
  real32_T Add2;                       /* '<S155>/Add2' */
  real32_T Add3;                       /* '<S155>/Add3' */
  real32_T Gain_n[3];                  /* '<S155>/Gain' */
  real32_T acos_m;                     /* '<S146>/acos' */
  real32_T bsin;                       /* '<S146>/bsin' */
  real32_T sum_Ds;                     /* '<S146>/sum_Ds' */
  real32_T bcos;                       /* '<S146>/bcos' */
  real32_T asin_i;                     /* '<S146>/asin' */
  real32_T sum_Qs;                     /* '<S146>/sum_Qs' */
  real32_T Switch_a[2];                /* '<S147>/Switch' */
  real32_T algDD_o1;
  real32_T algDD_o2;
  real32_T Product_gv[2];              /* '<S32>/Product' */
  real32_T SquareRoot;                 /* '<S32>/Square Root' */
  real32_T Switch_aa;                  /* '<S32>/Switch' */
  real32_T Reciprocal;                 /* '<S32>/Reciprocal' */
  real32_T Switch_af[2];               /* '<S29>/Switch' */
  real32_T Switch2;                    /* '<S39>/Switch2' */
  real32_T Product_e;                  /* '<S38>/Product' */
  real32_T Sum_k5;                     /* '<S38>/Sum' */
  real32_T Product2;                   /* '<S38>/Product2' */
  real32_T Merge_l;                    /* '<S38>/Merge' */
  real32_T Gain_d;                     /* '<S38>/Gain' */
  real32_T Switch_i;                   /* '<S39>/Switch' */
  real32_T Switch1;                    /* '<S40>/Switch1' */
  real32_T Sqrt;                       /* '<S40>/Sqrt' */
  real32_T Gain_a;                     /* '<S40>/Gain' */
  real32_T a_plus_2b;                  /* '<S24>/a_plus_2b' */
  real32_T one_by_sqrt3;               /* '<S24>/one_by_sqrt3' */
  real32_T algDD_o1_k;
  real32_T algDD_o2_o;
  int32_T SpeedCount;                  /* '<S189>/SpeedCount' */
  int32_T DataTypeConversion_c[2];     /* '<S184>/Data Type Conversion' */
  int32_T Add_e[2];                    /* '<S184>/Add' */
  int32_T Q17perunitconversion[2];     /* '<S184>/Q17 per unit conversion' */
  uint16_T Divide_g;                   /* '<S226>/Divide' */
  uint16_T Divide1;                    /* '<S226>/Divide1' */
  uint16_T ForIterator;                /* '<S229>/For Iterator' */
  uint16_T IAIBMeasurement[2];         /* '<S229>/IA//IB Measurement' */
  uint16_T Memory;                     /* '<S234>/Memory' */
  uint16_T Sum_k2;                     /* '<S234>/Sum' */
  uint16_T Memory1;                    /* '<S234>/Memory1' */
  uint16_T Sum1_b;                     /* '<S234>/Sum1' */
  uint16_T SCIReceive[2];              /* '<S240>/SCI Receive' */
  uint16_T eQEP_o1;                    /* '<S216>/eQEP' */
  uint16_T eQEP_o2;                    /* '<S216>/eQEP' */
  uint16_T Merge_e;                    /* '<S188>/Merge' */
  uint16_T DataStoreRead_g;            /* '<S184>/Data Store Read' */
  uint16_T DataStoreRead1;             /* '<S184>/Data Store Read1' */
  uint16_T IAIBMeasurement_g[2];       /* '<S216>/IA//IB Measurement' */
  uint16_T Output;                     /* '<S176>/Output' */
  uint16_T DataTypeConversion3[2];     /* '<S178>/Data Type Conversion3' */
  uint16_T SCI_Tx_Data[3];             /* '<S9>/Merge' */
  uint16_T SCI_Tx_Iteration;           /* '<S9>/Merge1' */
  uint16_T FixPtSum1;                  /* '<S181>/FixPt Sum1' */
  uint16_T FixPtSwitch;                /* '<S182>/FixPt Switch' */
  uint16_T Switch1_f[3];               /* '<S213>/Switch1' */
  uint16_T IndexVector;                /* '<S215>/Index Vector' */
  uint16_T Add_m;                      /* '<S215>/Add' */
  uint16_T Scale_to_PWM_Counter_PRD[3];/* '<S213>/Scale_to_PWM_Counter_PRD' */
  uint16_T Sum3_c;                     /* '<S204>/Sum3' */
  uint16_T Sum7;                       /* '<S204>/Sum7' */
  uint16_T Delay3;                     /* '<S186>/Delay3' */
  uint16_T Data[2];                    /* '<S177>/Data' */
  uint16_T Data_f[2];                  /* '<S179>/Data' */
  uint16_T Data_fw[2];                 /* '<S180>/Data' */
  uint16_T DataTypeConversion_l;       /* '<S170>/Data Type Conversion' */
  uint16_T Get_Integer;                /* '<S165>/Get_Integer' */
  uint16_T Switch1_b;                  /* '<S30>/Switch1' */
  uint16_T DataTypeConversion_cc;      /* '<S149>/Data Type Conversion' */
  uint16_T Get_Integer_i;              /* '<S21>/Get_Integer' */
  uint16_T DataTypeConversion_d;       /* '<S28>/Data Type Conversion' */
  uint16_T DataTypeConversion_n;       /* '<S38>/Data Type Conversion' */
  int16_T DataTypeConversion2[2];      /* '<S238>/Data Type Conversion2' */
  int16_T DataTypeConversion_de[2];    /* '<S178>/Data Type Conversion' */
  int16_T WhileIterator;               /* '<S215>/While Iterator' */
  int16_T DataTypeConversion_g;        /* '<S174>/Data Type Conversion' */
  int16_T Switch1_m;                   /* '<S67>/Switch1' */
  int16_T Switch2_m;                   /* '<S67>/Switch2' */
  int16_T Switch1_bv;                  /* '<S118>/Switch1' */
  int16_T Switch2_l;                   /* '<S118>/Switch2' */
  boolean_T NOT;                       /* '<S225>/NOT' */
  boolean_T DataTypeConversion3_e;     /* '<S6>/Data Type Conversion3' */
  boolean_T Delay_g;                   /* '<S183>/Delay' */
  boolean_T NOT_b;                     /* '<S183>/NOT' */
  boolean_T NOT_d;                     /* '<S8>/NOT' */
  boolean_T Enable;                    /* '<S12>/Enable' */
  boolean_T Compare;                   /* '<S193>/Compare' */
  boolean_T Compare_g;                 /* '<S194>/Compare' */
  boolean_T AND;                       /* '<S186>/AND' */
  boolean_T DataStoreRead1_c;          /* '<S16>/Data Store Read1' */
  boolean_T NOT_i;                     /* '<S162>/NOT' */
  boolean_T NOT_p;                     /* '<S161>/NOT' */
  boolean_T Compare_b;                 /* '<S171>/Compare' */
  boolean_T Delay_b;                   /* '<S174>/Delay' */
  boolean_T Compare_bb;                /* '<S150>/Compare' */
  boolean_T DataStoreRead1_e;          /* '<S27>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S27>/Logical Operator' */
  boolean_T DataStoreRead1_cr;         /* '<S26>/Data Store Read1' */
  boolean_T LogicalOperator_g;         /* '<S26>/Logical Operator' */
  boolean_T RelationalOperator;        /* '<S67>/Relational Operator' */
  boolean_T fixforDTpropagationissue; /* '<S67>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                     /* '<S67>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S67>/Equal1' */
  boolean_T AND3;                      /* '<S67>/AND3' */
  boolean_T RelationalOperator_l;      /* '<S118>/Relational Operator' */
  boolean_T fixforDTpropagationissue_l;
                                     /* '<S118>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1_p;
                                    /* '<S118>/fix for DT propagation issue1' */
  boolean_T Equal1_l;                  /* '<S118>/Equal1' */
  boolean_T AND3_h;                    /* '<S118>/AND3' */
  boolean_T RelationalOperator_b;      /* '<S28>/Relational Operator' */
  boolean_T Compare_e;                 /* '<S34>/Compare' */
  boolean_T Compare_c;                 /* '<S35>/Compare' */
  boolean_T LowerRelop1;               /* '<S39>/LowerRelop1' */
  boolean_T RelationalOperator_n;      /* '<S38>/Relational Operator' */
  boolean_T UpperRelop;                /* '<S39>/UpperRelop' */
  rtB_SpeedControl_mcb_pmsm_foc_q SpeedControl;/* '<Root>/Speed Control' */
  rtB_SPIMasterTransfer_mcb_pmsm_ SPIMasterTransfer1;/* '<S227>/SPI Master Transfer' */
  rtB_SPIMasterTransfer_mcb_pmsm_ SPIMasterTransfer;/* '<S227>/SPI Master Transfer' */
  rtB_IfActionSubsystem1_mcb_pmsm IfActionSubsystem1_i;/* '<S170>/If Action Subsystem1' */
  rtB_IfActionSubsystem_mcb_pmsm_ IfActionSubsystem_gq;/* '<S170>/If Action Subsystem' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_q TwoinputsCRL_ie;/* '<S164>/Two inputs CRL' */
  rtB_IfActionSubsystem1_mcb_pmsm IfActionSubsystem1_o;/* '<S149>/If Action Subsystem1' */
  rtB_IfActionSubsystem_mcb_pmsm_ IfActionSubsystem_g;/* '<S149>/If Action Subsystem' */
  rtB_TwoinputsCRL_mcb_pmsm_foc_q TwoinputsCRL;/* '<S19>/Two inputs CRL' */
} BlockIO_mcb_pmsm_foc_qep_f28069;

