tefilus/MBD_PMSM/exampleFOCQep/mcb_pmsm_foc_qep_f28069LaunchPad_ert_rtw/mcb_pmsm_foc_qep_f28069LaunchPad.h
/* Block states (default storage) for system '<Root>' */
typedef struct {
  real32_T UnitDelay_DSTATE;           /* '<S192>/Unit Delay' */
  real32_T RampGenerator_DSTATE;       /* '<S162>/Ramp Generator' */
  real32_T UnitDelay_DSTATE_m;         /* '<S161>/Unit Delay' */
  real32_T Integrator_DSTATE;          /* '<S127>/Integrator' */
  real32_T Integrator_DSTATE_h;        /* '<S76>/Integrator' */
  uint32_T Delay_DSTATE[20];           /* '<S189>/Delay' */
  volatile real32_T RT1_Buffer[2];     /* '<Root>/RT1' */
  volatile real32_T RT6_Buffer[2];     /* '<Root>/RT6' */
  real32_T SpeedRef;                   /* '<Root>/Data Store Memory4' */
  int32_T DigitalOutput1_FRAC_LEN;     /* '<S236>/Digital Output1' */
  int32_T DigitalOutput_FRAC_LEN;      /* '<S227>/Digital Output' */
  int32_T SpeedCount_DWORK1;           /* '<S189>/SpeedCount' */
  int32_T Add_DWORK1[2];               /* '<S184>/Add' */
  int32_T DigitalOutput_FRAC_LEN_d;    /* '<S213>/Digital Output' */
  uint32_T Sum_DWORK1[4];              /* '<S165>/Sum' */
  uint16_T Output_DSTATE;              /* '<S176>/Output' */
  uint16_T Delay3_DSTATE;              /* '<S186>/Delay3' */
  volatile int16_T RT1_ActiveBufIdx;   /* '<Root>/RT1' */
  volatile int16_T RT1_semaphoreTaken; /* '<Root>/RT1' */
  volatile int16_T RT6_ActiveBufIdx;   /* '<Root>/RT6' */
  uint16_T IaOffset;                   /* '<Root>/Data Store Memory1' */
  uint16_T IbOffset;                   /* '<Root>/Data Store Memory2' */
  uint16_T Memory_PreviousInput;       /* '<S234>/Memory' */
  uint16_T Memory1_PreviousInput;      /* '<S234>/Memory1' */
  uint16_T CircBufIdx;                 /* '<S189>/Delay' */
  uint16_T Add_DWORK1_b;               /* '<S215>/Add' */
  boolean_T Delay_DSTATE_l;            /* '<S183>/Delay' */
  boolean_T Delay_DSTATE_e;            /* '<S174>/Delay' */
  int16_T Integrator_PrevResetState;   /* '<S127>/Integrator' */
  int16_T Integrator_PrevResetState_f; /* '<S76>/Integrator' */
  boolean_T Enable;                    /* '<Root>/Data Store Memory29' */
  boolean_T EnClosedLoop;              /* '<Root>/Data Store Memory3' */
  boolean_T OpenLoopStartUp_MODE;      /* '<S8>/Open Loop Start-Up' */
  rtDW_SpeedControl_mcb_pmsm_foc_ SpeedControl;/* '<Root>/Speed Control' */
  rtDW_SPIMasterTransfer_mcb_pmsm SPIMasterTransfer1;/* '<S227>/SPI Master Transfer' */
  rtDW_SPIMasterTransfer_mcb_pmsm SPIMasterTransfer;/* '<S227>/SPI Master Transfer' */
} D_Work_mcb_pmsm_foc_qep_f28069L;

/* Invariant block signals (default storage) */
typedef struct {
  const uint16_T Width;                /* '<S9>/Width' */
} ConstBlockIO_mcb_pmsm_foc_qep_f;

/* Constant parameters (default storage) */
typedef struct {
  /* Pooled Parameter (Expression: )
   * Referenced by:
   *   '<S21>/sine_table_values'
   *   '<S165>/sine_table_values'
   */
  real32_T pooled4[1002];
} ConstParam_mcb_pmsm_foc_qep_f28;

/* Real-time Model Data Structure */
struct tag_RTM_mcb_pmsm_foc_qep_f28069 {
  const char_T * volatile errorStatus;

  /*
   * Timing:
   * The following substructure contains information regarding
   * the timing information for the model.
   */
  struct {
    struct {
      uint16_T TID[2];
    } TaskCounters;
  } Timing;
};

/* Block signals (default storage) */
extern BlockIO_mcb_pmsm_foc_qep_f28069 mcb_pmsm_foc_qep_f28069Launch_B;

/* Block states (default storage) */
extern D_Work_mcb_pmsm_foc_qep_f28069L mcb_pmsm_foc_qep_f28069La_DWork;
extern const ConstBlockIO_mcb_pmsm_foc_qep_f mcb_pmsm_foc_qep_f28069L_ConstB;/* constant block i/o */

/* Constant parameters (default storage) */
extern const ConstParam_mcb_pmsm_foc_qep_f28 mcb_pmsm_foc_qep_f28069L_ConstP;

/* External function called from main */
extern void mcb_pmsm_foc_qep_f28069LaunchPad_SetEventsForThisBaseStep(boolean_T *
  eventFlags);

/* Model entry point functions */
extern void mcb_pmsm_foc_qep_f28069LaunchPad_initialize(void);
extern void mcb_pmsm_foc_qep_f28069LaunchPad_step0(void);
extern void mcb_pmsm_foc_qep_f28069LaunchPad_step1(void);
extern void mcb_pmsm_foc_qep_f28069LaunchPad_terminate(void);

/* Real-time Model object */
extern RT_MODEL_mcb_pmsm_foc_qep_f2806 *const mcb_pmsm_foc_qep_f28069Launc_M;
extern volatile boolean_T stopRequested;
extern volatile boolean_T runModel;

#ifdef __cpluscplus

extern "C"
{

#endif

  interrupt void ADCINT1(void);
  interrupt void SCIRXINTA(void);
  void mcb_pmsm_foc_qep_f28069LaunchPad_configure_interrupts (void);
  void mcb_pmsm_foc_qep_f28069LaunchPad_unconfigure_interrupts (void);

#ifdef __cpluscplus

}

#endif

/*-
 * The generated code includes comments that allow you to trace directly
 * back to the appropriate location in the model.  The basic format
 * is <system>/block_name, where system is the system number (uniquely
 * assigned by Simulink) and block_name is the name of the block.
 *
 * Use the MATLAB hilite_system command to trace the generated code back
 * to the model.  For example,
 *
 * hilite_system('<S3>')    - opens system 3
 * hilite_system('<S3>/Kp') - opens and selects block Kp which resides in S3
 *
 * Here is the system hierarchy for this model
 *
 * '<Root>' : 'mcb_pmsm_foc_qep_f28069LaunchPad'
 * '<S1>'   : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control'
 * '<S2>'   : 'mcb_pmsm_foc_qep_f28069LaunchPad/HW Interrupt'
 * '<S3>'   : 'mcb_pmsm_foc_qep_f28069LaunchPad/Hardware Init'
 * '<S4>'   : 'mcb_pmsm_foc_qep_f28069LaunchPad/Heartbeat LED'
 * '<S5>'   : 'mcb_pmsm_foc_qep_f28069LaunchPad/Inverter and Motor - Plant Model'
 * '<S6>'   : 'mcb_pmsm_foc_qep_f28069LaunchPad/Serial Receive'
 * '<S7>'   : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control'
 * '<S8>'   : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System'
 * '<S9>'   : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Data_Logging'
 * '<S10>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Input Scaling'
 * '<S11>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Inverter'
 * '<S12>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Output Scaling'
 * '<S13>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/SCI_Tx'
 * '<S14>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Sensor Driver Blocks'
 * '<S15>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control'
 * '<S16>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Open Loop Start-Up'
 * '<S17>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Clarke Transform'
 * '<S18>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers'
 * '<S19>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Inverse Park Transform'
 * '<S20>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Park Transform'
 * '<S21>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Sine-Cosine Lookup'
 * '<S22>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Space Vector Generator'
 * '<S23>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Clarke Transform/Two phase input'
 * '<S24>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Clarke Transform/Two phase input/Two phase CRL wrap'
 * '<S25>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter'
 * '<S26>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id'
 * '<S27>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq'
 * '<S28>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/D-Q Equivalence'
 * '<S29>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/D//Q Axis Priority'
 * '<S30>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/Inport//Dialog Selection'
 * '<S31>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/Magnitude_calc'
 * '<S32>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/D-Q Equivalence/Limiter'
 * '<S33>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/D-Q Equivalence/Passthrough'
 * '<S34>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/Compare To Constant'
 * '<S35>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/Compare To Constant1'
 * '<S36>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/flipInputs'
 * '<S37>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/flipInputs1'
 * '<S38>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter'
 * '<S39>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/limitRef1'
 * '<S40>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/limitRef2'
 * '<S41>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/passThrough'
 * '<S42>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset'
 * '<S43>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S44>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S45>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S46>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S47>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S48>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S49>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S50>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S51>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S52>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S53>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S54>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S55>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S56>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S57>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S58>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S59>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S60>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S61>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S62>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S63>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S64>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S65>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S66>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S67>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S68>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S69>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S70>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S71>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S72>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S73>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S74>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S75>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S76>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S77>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S78>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S79>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S80>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S81>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S82>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S83>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S84>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S85>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S86>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S87>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S88>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S89>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S90>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S91>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S92>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S93>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset'
 * '<S94>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S95>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S96>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S97>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S98>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S99>'  : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S100>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S101>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S102>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S103>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S104>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S105>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S106>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S107>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S108>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S109>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Current Control/Control_System/Closed Loop Control/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
