tefilus/MBD_PMSM/exampleFOCQep/mcb_pmsm_foc_qep_f28069LaunchPad_ert_rtw/mcb_pmsm_foc_qep_f28069LaunchPad.h
 * '<S271>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S272>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S273>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S274>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S275>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S276>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S277>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S278>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S279>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S280>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S281>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S282>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S283>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S284>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S285>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S286>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S287>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S288>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S289>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S290>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S291>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S292>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S293>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S294>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S295>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter'
 * '<S296>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter/Low-pass'
 * '<S297>' : 'mcb_pmsm_foc_qep_f28069LaunchPad/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter/Low-pass/IIR Low Pass Filter'
 */
#endif                      /* RTW_HEADER_mcb_pmsm_foc_qep_f28069LaunchPad_h_ */

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
